{
  "PRODUCT NAME - ": "Amozo Ultra Hybrid Camera and Drop Protection Back Cover Case for iPhone 13 (TPU + Polycarbonate | Crystal Transparent)",
  "link to the product - ": "https://www.amazon.in//Amozo-Cover-iPhone-Polycarbonate-Transparent/dp/B09J2MM5C6/ref=cm_cr_arp_d_product_top?ie=UTF8",
  "4.1 out of 5": "4,377 global ratings",
  "TOP POSITIVE COMMENTS - ": [
    "Nice and sturdy",
    "Durable and sturdy. Good value for money, also shows my iPhone Colour"
  ],
  "TOP CRITICAL COMMENTS - ": [
    "Not so good. Material used is not good.",
    "Very Good material and product in this reasonable price . Better option available from market"
  ],
  "Someone ": "Ok but not good for protections purpose and about yellowish so it is being only one week i am using this cover so it is not turned yellow till now",
  "Ricky Parmar": "I was kind of confused between 1.5K Spigen cover vs Rs 250 Amozo cover and happen to take a chance on Amozo brand. To be honest I did not expect this product to be this good and I absolutely recommend anyone to go with this cover. I cannot differentiate between Spigen cover and Amozo cover even in terms of touch, feel and quality. It does protect your phone and is very similar to Spigen cover that I am using on my Samsung S9. This transparent cover might last for 6 months given this product yellow stain occurrence and it should be OK at this price point.",
  "Razzaq": "Very Good material and product in this reasonable price . Better option available from market",
  "Kunal Vashisth": "Fitting my phone into the case wasn't super easy and smooth. Otherwise, the case is good.",
  "Nikki": "After use colour is changed like dusty. Don’t buy poor quality.",
  "Crazy Curious Reader": "Good",
  "abhishek": "Gud",
  "jimil jose": "Good",
  "Achanta Visweswari": "Good",
  "Amazon Customer": "Value for money",
  "Jaikul M G": "GOOD QUALITY",
  "Akhil jandial": "Good product",
  "binu": "Nice product.",
  "ashok kumar": "Very good",
  "Amardeep Ranjan": "Build quality is good",
  "Sumit Bhatia": "good one /recommended",
  "abdul rafi sheik": "Nice to use this product",
  "Ratheesh S.": "\n",
  "Vijay": "Turns yellow within 2 weeks",
  "Gargi Sanyal": "Good product",
  "Ajith": "Good",
  "Nirav": "Waste of money",
  "Ujjal ghosh": "Dust particles are keep getting inside of cover and I am sick of cleaning it and it got yellow within 14-16 day",
  "Waanglar shilywar Monsang": "Good one",
  "Aditi Vyas": "\n",
  "Senthil": "grip",
  "Renju Depp": "Got a defective cover",
  "UEBAYASHI": "Fitting is good, but colour changing with in 2 days of handling.",
  "Jaganath Chennaiyan": "Bought this decent Transparent Iphone Cover For My new Iphone 13.",
  "Jaffer Shaikh": "The product is durable and of good quality",
  "Sandip Kumar De": "It Fits well and looks good quality … nice Bargain !",
  "Aman Srivastava": "Good quality but as all transparent covers this too gets yellow within a few months",
  "Batman": "Very nice. Light weight and good quality fit for the phone",
  "Debaditya Dutta": "Good quality",
  "venkatachalapathi": "I loved it",
  "Joni saha": "Very good",
  "It’s amazing I’m posting this review after using it for 25 days .. there’s no problem and the experience is literally awesome": "",
  "darshan reddy": "Great fit to the phone and good quality",
  "Sravya damera": "Really well worth purchasing this product",
  "Vinay": "I like this. As expected it's enough hard to protect the iPhone.",
  "Saksham Sharma": "Strong and elegant case. Definitely worth the price. Go for it.",
  "DEEPAK RAVLO": "best products",
  "Omkar Kinkar": "Overall cover quality is awesome in this price range(below 300₹), but after 6 it got yellowish from sides.",
  "Gayathri": "I got this for cheep and I like it for what it is. I would not have payd full price for it price for this. However, it is a great case, since I do not remove my case that often it sits tyte and dosenot come off. at first I thought that i could not put it on the phone but it just takes a lintel bit of steady hand to put it onn. 4/5.",
  "Meghna Saha": "Its a good fit product look good but within 10 days it starts changing its colour a little yellowish.",
  "Yogesh Gawande Patil": "\n",
  "Nandish Hiremath": "I purchased the phone case on my brothers recommendation, it is as good as he said it was. Looks very good and sturdy",
  "Shrikant": "Looking great in this budget &amp; case is also very hard, finally thanks to Amazon for this amazing product!",
  "kartik sarkar": "Soft material",
  "AMIT JAIN": "Complete waste and incompatible with iPhone 13. Obstructs the charger by blocking the port. Was a gift so learnt this after the return window.",
  "pgcorpo": "So transparent it enhances the beauty of the iPhone! It has a cushion grip, so less strain on fingers and more grippy. Excellent product.",
  "Vetri": "My only complaint is it is slippery, other than that it is worth buying for 279rs",
  "Sanil Issac Palat": "It's changing yellow colour fastly I have purchased 2 times and having the same results but the product was just good only",
  "KiranVS": "It’s a good cover. Very clear and transparent and maintains the colour and the feel of the phone. It isn’t bigger than it’s supposed to be and the buttons and everything is set in the right place. Very satisfied with the product. Would purchase this again. Hopefully it doesn’t turn yellow anytime soon.",
  "Dinesh ": "It’s perfect. I loved it. Button placement and cutouts are perfect. Impeccable pricing. Eventually it becomes yellowish but for the price its worthy.",
  "♥️": "Best for those who want a transparent cover",
  "Chimmy": "Good quality just issue it turns yellow within a month. This is my second case and the result is same",
  "jyoti": "Value for money",
  "sayantan": "Bought the same cover for another phone!",
  "Charles Leo Prince F": "For the price product is of good quality but it doesnt fit my iphone 13… waste of money",
  "Rasham": "Nice product I purchased as on date it was not shaded",
  "Sharath Kumar": "Saved my phone from damage many times.",
  "Srikanth guttula": "I have tried spigen, ringke but they really are not my type. I wanted something simple and handy and this case meets the requirements. Transparent back and is very slim. Blindly go for it, you'll love it.",
  "Shiva": "Great product, reasonably priced.",
  "Renu": "As per the description on amazon app. First time it matches with whatever written in app. Really good product. And in this price range it is really worth. If you go offline for this they will really charge more.",
  "NAVI": "It doesn't feel very strong to protect your phone from a fall",
  "myasho": "The case is flawless, but it attracts a lot of fingerprints. If you have some light colour iPhone it won’t appears a lot, but if you have dark colours like midnight and green the fingerprints appears a lot",
  "Swapnil kirloskar": "Liked it",
  "Dinesh babu": "The cover is simply amazing, at that rate it feels like I spent some crazy amount of money for it but I did not, infact I liked it so much am ordering another one..good work guys!!",
  "Ravi Mohan": "Okay",
  "Hiraj Kane": "The product was full of scratches",
  "Krishnan": "Serves the purpose and very economical option, very useful"
}
