{
  "Ajin V": "High quality camera😍",
  "Sheetla Prasad Maurya": "Best mobile phone",
  "mohit  yadav ": "Nice ❤️",
  "Mousam  Guha Roy": "Very nice",
  "Prithivi Boruah": "Camera Quality Is Improved Loving It",
  "Talim (sk)": "I love this phone. The camera is amazing: its I am so happy",
  "Rahul Shedge": "Totally happy!",
  "Ankit  Verma ": "Awesome camra quality superb camra 😊",
  "Saurabh Gothwad": "Simply premium.",
  "Kishu Kumar": "Absolutely premium product..just wow",
  "Suman Jain": "Simply Awesome 🤩",
  "Raj Singh": "for me its 10 out of 10✨",
  "Jayanta  Roy": "Nice 🙂🙂🙂🙂🙂",
  "Praveen Kumar": "This is my first iphone ever used loving it already this is worth it 🥰",
  "SANDEEP SOMAN": "48 megapixel is lit🔥",
  "Akhilesh Bepari": "It's performance is super and nice camera also a ok battery backup..",
  "Naveen S": "Very nice product☺️☺️we loved the phone very much",
  "SONAL PAL": "Awesome phone powerful performance and battery backup are also very good no heating issue ☺️",
  "Atul Negi": "It looks so good in my hand !.......WAU?",
  "Abhishek Pratap Singh": "Nice click",
  "Manya Customer": "The phone is pretty awesome! Switching from android to ios. Smooth performance, amazing camera and battery backup so far is great. Worth it!",
  "Nilesh  Yadav": "Best in class..! Superb camera and performance. Fine grip.",
  "AYUSH singh": "best camera and battery is also very good ",
  "Thilak Kumar": "I upgraded from iPhone 13 to 15 and this phone is awesome worth the money go for it",
  "Akshay Meena": "So beautiful, so elegant, just a vowww😍❤️",
  "Mukesh Kumar": "Pic Quality Awesome",
  "jay singh": "Just upgraded from iphone 12 to 15 and I totally loved this 15 series.",
  "Zeeshan Khan": "Awesome quality I am very happy. Thank you Flipkart.",
  "A L Naveen Kumar": "Phone is heating up too much, even after multiple software upgrades, not suggest to buy, please ignore",
  "Dev  Kumar ": "Camera quality top notch 👍",
  "Mohammad Amir": "Design and performance is good. But somehow I felt the quality and standard is not the same as it used to be. It does heat up while charging and prolonged usage. This is unexpected and unacceptable. Also there are connectivity issues with Apple CarPlay.",
  "Ashish  Raj": "Awesome phone ❤️",
  "Amitabh Srivastava": "This is an amazing phone and back side of phone is frozen glass which makes it less prone to finger marks while holding. Till now enjoying it, will update with further details after a week.",
  "Mohd Hasnain": "Upgraded from iPhone 11, The camera quality is awesome",
  "Aarif  Khan ": "Apple iPhone 15 blue 128GB GOOD MOBILE  phone Name Aarif khan Alwar Rajasthan Indian",
  "Suraj Mehra": "Nice",
  "Harpreet Singh": "v v good",
  "Shivani Jain": "Awesome😍switch from android to iOS",
  "Urgain Norzin": "It's amazing nd also the delivery boy was very humble.",
  "K.srinath Sri": "Amazing product❤️❤️",
  "Arman Ali": "Pros",
  "Manish Singh": "Heating issue",
  "Rajveer Singh": "Best in class Device, Apple never ceases to Amaze customers. Lightweight and sleek look. Matte back finish helps with a fine grip.",
  "Yadu krishnan ": "Awesome experience. thanks to flipkart",
  "Nasir Uddin Sheikh": "iPhone 15 impresses with sleek design, powerful performance, and stunning camera upgrades. A technological leap forward, delivering a top-tier experience. 😍😊👍",
  "RAHUL  SEN": "Such a amazing phone 🫶🏻",
  "Sanjay  Yadav ": "Good product",
  "Flipkart Customer": "This mobile is phenomenal, I like the camera most",
  "Subhodeep Roy": "Fully satisfied 👍🏻",
  "MOHAMMAD SHAHNAWAZ": "Gud product",
  "Sushobhit Meena": "Good phone but display 60 hz very slow in 2023",
  "Shubhanker  Singh ": "Simply wow wow wow 😍❤️",
  "kowshik chinnu": "In one word Excellent mobile🥳",
  "shanavas vn": "SUPER ",
  "Nitin Patil": "Look and design very nice",
  "Raghupathireddy Paindla": "Very good. Happy with the product. Camera quality and performance is amazing.",
  "Utpal  Mondal ": "This is undoubtedly the best in the market! Feels premium and also the performance is at par excellence! A beast in terms of camera quality and battery backup!",
  "KALPESH SHIRSEKAR": "Coming from iphone 12 mini.",
  "Kishan  Behera": "Speechless",
  "Biswadeep Roy": "Far better than 15pro no finger print even with moisturize hands",
  "Naresh Soni": "Very good",
  "Nirmala Sahu": "Just ok like any other premium android phone. Sound is just fantastic and face unlock feature is more convenient than fingerprint scanner. Battery backup is more than android 5000 mah battery. This is my frist iPhone, migrated from android due to chipset heating problem in Google tensor chip and Samsung exonys processsor.",
  "Nikhil Kumar": "No doubt this smartphone an art.",
  "Nalinakshya Sahoo": "Phone is good. Good battery backup , upgraded camera. ",
  "SHASHANK PATHAK": "Great Experience Flipkart I am giving 10 of 10 Camera, Sound, Screen... Transportation Mi note 9 pro Max to Iphone 15 .",
  "NOOR ALAM": "Awsm 😍😍",
  "SOURAV NANDI": "Amazing. This is my second iphone after 11 pro.",
  "Anwar Customer": "Only 90fps is need ",
  "Durga prasad": "Good",
  "Akshat Kumar Anshu": "Absolutely Amazing!",
  "Sohel Seikh": "Nothing to say..✌️",
  "Jayanth K B": "I just loved it 😍Thank you so much ❤️",
  "Atul": "selfy camera is not good",
  "Gautam Mandal": "Awesome buy",
  "ANUP SINGH GAUTAM": "Absolutely gorgeous 😻",
  "sehaj anand": "Build quality is very poor. my phone got many dents even on a low fall , iphones were known to their build quality but this is very poor",
  "Venkat Ramana": "Amazing 😍😍😍😍",
  "Akshit": "Very good experience, highly recommended for upgrade",
  "ABDUR RAHMAN ": "First time experiencing I phone. It feels premium and quality is awesome love it ❤️❤️❤️",
  "Tekchand Biswal": "Nice product. The look of the phone is awesome 👌. Great to have the iphone black color.",
  "Krupansh Patel": "Overall Beast Performance 🔥",
  "anujyadav anuj": "Very good product",
  "Dev Sarda": "The best one from apple💙",
  "Sreenivas Vadde": "My dream comes true",
  "Navin Srivastava": "Camera is a major upgrade over previous models. If you have 12 or older you can upgrade to 15 without thinking",
  "Mitul Patel ": "The products are good but Flipkart services are  very third class and exchange services are very third class and they didn't have knowledge for exchanging the product .",
  "Ajay G": "Back to iPhone family from android, best upgrade phone. Fully satisfied with the design and the performance. Minimum 10hrs of battery on single charge (12hrs in low power mode). No lags and even it charges very fast up to 80% which is decent.",
  "Abhisekh Kumar": "I can say the 60hz doesn't feel 60hz it is very smooth and may be because of apple",
  "Muhammed  Muhasin P N": "Its the perfect phone for me.",
  "Mohammad  Mubarak": "Everything lovely ",
  "Sharon Lepcha": "I was sceptical of online purchase but I was wrong I got what I ordered ",
  "Gulshan  Ahmed": "Overall same",
  "Prasanta Mohalik.": "camera quality is best",
  "VIJAY  Bisht ": "Apart from the refresh rate every thing is top notch .",
  "K Deepak": "Awesome product"
}